{
  "backend/main.mo": "Motoko actor implementing a racing game backend with score submission (restricted to authorized users) and a leaderboard query that filters and sorts scores by car type and game mode.",
  "feature_evidence.json": "Feature evidence report mapping implemented game features (3D track, car models, single-player, multiplayer, etc.) to their corresponding source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document providing short descriptions of key frontend source files, noting specific implementation details and bug fixes applied to each component.",
  "frontend/index.css": "Global stylesheet importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "HTML entry point for the Apex Racers app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for the main menu, car selection, single-player race, multiplayer race, finish screen, and leaderboard, all wrapped in a GameProvider context.",
  "frontend/src/components/game/AICar.tsx": "AI-controlled car component that follows track waypoints using steering and speed logic each frame, slowing on sharp turns and accepting a difficulty multiplier to scale target speed.",
  "frontend/src/components/game/Car.tsx": "Reusable 3D car mesh component built from Three.js box geometries representing the body, cabin, wheels, lights, spoiler, and other details, styled via CarConfig color properties.",
  "frontend/src/components/game/CountdownOverlay.tsx": "UI overlay that displays a 3-2-1-GO countdown with color-coded animated text, then hides itself and calls an onComplete callback to start the race.",
  "frontend/src/components/game/Environment.tsx": "3D environment component rendering a night sky sphere with a texture and four stadium light poles with emissive fixtures and point lights for scene illumination.",
  "frontend/src/components/game/FollowCamera.tsx": "Camera controller component that smoothly lerps the Three.js camera to a position behind and above a target car group each frame, looking slightly ahead of the car.",
  "frontend/src/components/game/HUD.tsx": "Renders an in-game heads-up display overlay showing lap count, race position, elapsed/best lap times, speed, and optional player label using formatted time and ordinal helpers.",
  "frontend/src/components/game/PlayerCar.tsx": "Handles player car physics and input each frame—acceleration, braking, steering, and wheel animation—then syncs the 3D mesh position/rotation and reports speed and position via callbacks.",
  "frontend/src/components/game/RaceTrack.tsx": "Procedurally builds and renders the race track surface geometry, roadside barriers, start/finish line, and a textured ground plane from TRACK_WAYPOINTS data.",
  "frontend/src/components/game/Scene.tsx": "Sets up the Three.js Canvas with shadows, camera, lighting (ambient, directional, hemisphere), and renders the Environment and RaceTrack alongside any child components.",
  "frontend/src/components/game/trackData.ts": "Exports the oval track center-line waypoints array, track width constant, and default start position/rotation for the race.",
  "frontend/src/context/GameContext.tsx": "Provides a React context storing selected cars for both players, race results, and total laps, with corresponding setters accessible via the useGameContext hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (anonymous or authenticated) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider using DFINITY's AuthClient, exposing login/clear functions, identity state, and login status to child components.",
  "frontend/src/hooks/useKeyboardControls.ts": "Tracks WASD/arrow key and spacebar state in a ref by attaching keydown/keyup listeners, returning a Controls ref for player 1 input.",
  "frontend/src/hooks/useKeyboardControlsP2.ts": "Same as useKeyboardControls but mapped to arrow keys and right Shift for player 2 input in local multiplayer.",
  "frontend/src/hooks/useQueries.ts": "Provides useLeaderboard (fetches scores by car/mode) and useSubmitScore (posts a new score and invalidates leaderboard cache) hooks backed by the ICP actor.",
  "frontend/src/hooks/useRaceLogic.ts": "Custom React hook that manages race state including lap tracking, waypoint progression, car positions/rankings, and finish detection for multiple cars using Three.js vectors.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Orbitron/Rajdhani fonts, and defines a dark racing-themed design system with custom neon color tokens, component styles, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/pages/CarSelection.tsx": "Car selection page allowing two players to independently browse and confirm car choices from CAR_CONFIGS, displaying stat bars for each car before navigating back to the main menu.",
  "frontend/src/pages/Leaderboard.tsx": "Leaderboard page that fetches and displays top race scores filtered by car type and game mode, with formatted times and ordinal rankings.",
  "frontend/src/pages/LocalMultiplayerRace.tsx": "Local multiplayer race page that renders a Three.js/R3F scene with two player-controlled cars and one AI car, wiring up keyboard controls, race logic, HUD, and a follow camera.",
  "frontend/src/pages/MainMenu.tsx": "Main menu page displaying navigation buttons for Single Player, Local Multiplayer, Car Selection, and Leaderboard, with a styled neon racing aesthetic including background grid, glow orbs, and animated logo.",
  "frontend/src/pages/RaceFinish.tsx": "Race finish screen that displays final standings, best lap times, and medals for all racers, and automatically submits player scores to the leaderboard via the useSubmitScore hook.",
  "frontend/src/pages/SinglePlayerRace.tsx": "Single-player race page that renders a 3D scene with a player car, two AI opponents, a follow camera, HUD, and countdown overlay, managing race state and navigating to the finish screen when the race ends.",
  "frontend/src/types/car.ts": "Defines the CarConfig interface with stats and physics properties, and exports an array of three preconfigured cars: Nissan GT-R, Porsche 911, and BMW M5.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and remove sensitive parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with racing-themed fonts (Orbitron, Rajdhani), neon color tokens, custom box shadows, and keyframe animations like countdown and fadeIn, with typography, container-queries, and animate plugins.",
  "project_state.json": "Defines the project state for 'Apex Racers', a 3D offline car racing game with multiplayer support, listing architectural notes, existing features, image requirements, and known issues."
}